OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/combustion/XiDyMFoam/annularCombustorTurbine/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType      LES;

LES
{
    LESModel        kEqn;

    delta           cubeRootVol;

    turbulence      on;

    printCoeffs     on;

    oneEqEddyCoeffs
    {
        Prt             1;
    }

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
}


// ************************************************************************* //
